koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/SPI_STM32F1xx.c
/*
 * Copyright (C) 2018-2020 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Project: SPI Driver for STMicroelectronics STM32F1xx
 */

/*******************************************************************************
 *  includes
 ******************************************************************************/

#include "SPI_STM32F1xx.h"

#if defined(USE_SPI1) || defined(USE_SPI2) || defined(USE_SPI3)

/*******************************************************************************
 *  external declarations
 ******************************************************************************/

/*******************************************************************************
 *  defines and macros (scope: module-local)
 ******************************************************************************/

#define SPI_DRV_VERSION   DRIVER_VERSION_MAJOR_MINOR(1,0)

/*******************************************************************************
 *  typedefs and structures (scope: module-local)
 ******************************************************************************/

/*******************************************************************************
 *  function prototypes (scope: module-local)
 ******************************************************************************/

/*******************************************************************************
 *  global variable definitions (scope: module-local)
 ******************************************************************************/

// Driver Version
static const DRIVER_VERSION DriverVersion = {
    SPI_API_VERSION,
    SPI_DRV_VERSION
};

// Driver Capabilities
static const
SPI_CAPABILITIES DriverCapabilities = {
    0,  /* Simplex Mode (Master and Slave) */
    0,  /* TI Synchronous Serial Interface */
    0,  /* Microwire Interface */
    1   /* Signal Mode Fault event: \ref SPI_EVENT_MODE_FAULT */
};

static const GPIO_PIN_CFG_t SPI_pin_cfg_af = {
    GPIO_MODE_AF_PP, GPIO_PULL_DISABLE, GPIO_SPEED_HIGH
};

static const GPIO_PIN_CFG_t SPI_pin_cfg_analog = {
    GPIO_MODE_ANALOG, GPIO_PULL_DISABLE, GPIO_SPEED_LOW
};

static const GPIO_PIN_CFG_t SPI_pin_cfg_out_pp = {
    GPIO_MODE_OUT_PP, GPIO_PULL_DISABLE, GPIO_SPEED_MEDIUM
};

#if defined(USE_SPI1)

/* SPI1 Run-Time Information */
static SPI_INFO          SPI1_Info         = { 0U };
static SPI_TRANSFER_INFO SPI1_TransferInfo = { 0U };

#ifdef USE_SPI1_MOSI_Pin
  static SPI_PIN SPI1_mosi = {SPI1_MOSI_GPIOx, SPI1_MOSI_GPIO_Pin};
#endif
#ifdef USE_SPI1_MISO_Pin
  static SPI_PIN SPI1_miso = {SPI1_MISO_GPIOx, SPI1_MISO_GPIO_Pin};
#endif
#ifdef USE_SPI1_NSS_Pin
  static SPI_PIN SPI1_nss  = {SPI1_NSS_GPIOx,  SPI1_NSS_GPIO_Pin};
#endif
  static SPI_PIN SPI1_sck  = {SPI1_SCK_GPIOx,  SPI1_SCK_GPIO_Pin};


#ifdef SPI1_RX_DMA_Instance
static SPI_DMA SPI1_DMA_Rx = {
  SPI1_RX_DMA_Instance,
  SPI1_RX_DMA_Channel,
  SPI1_RX_DMA_Priority,
  SPI1_RX_DMA_IRQn
};
#endif

#ifdef SPI1_TX_DMA_Instance
static SPI_DMA SPI1_DMA_Tx = {
  SPI1_TX_DMA_Instance,
  SPI1_TX_DMA_Channel,
  SPI1_TX_DMA_Priority,
  SPI1_TX_DMA_IRQn
};
#endif

/* SPI1 Resources */
static const SPI_RESOURCES SPI1_Resources = {
  SPI1,
  RCC_PERIPH_SPI1,
  // PINS
  {
#ifdef USE_SPI1_MOSI_Pin
    &SPI1_mosi,
#else
    NULL,
#endif
#ifdef USE_SPI1_MISO_Pin
    &SPI1_miso,
#else
    NULL,
#endif
#ifdef USE_SPI1_NSS_Pin
    &SPI1_nss,
#else
    NULL,
#endif
    &SPI1_sck,
    SPI1_REMAP_DEF,
    SPI1_REMAP
  },
  SPI1_IRQn,
#ifdef SPI1_RX_DMA_Instance
  &SPI1_DMA_Rx,
#else
  NULL,
#endif
#ifdef SPI1_TX_DMA_Instance
  &SPI1_DMA_Tx,
#else
  NULL,
#endif
  &SPI1_Info,
  &SPI1_TransferInfo
};
#endif /* USE_SPI1 */

#if defined(USE_SPI2)

/* SPI2 Run-Time Information */
static SPI_INFO          SPI2_Info         = { 0U };
static SPI_TRANSFER_INFO SPI2_TransferInfo = { 0U };


#ifdef USE_SPI2_MOSI_Pin
  static SPI_PIN SPI2_mosi = {SPI2_MOSI_GPIOx, SPI2_MOSI_GPIO_Pin};
#endif
#ifdef USE_SPI2_MISO_Pin
  static SPI_PIN SPI2_miso = {SPI2_MISO_GPIOx, SPI2_MISO_GPIO_Pin};
#endif
#ifdef USE_SPI2_NSS_Pin
  static SPI_PIN SPI2_nss  = {SPI2_NSS_GPIOx,  SPI2_NSS_GPIO_Pin};
#endif
  static SPI_PIN SPI2_sck  = {SPI2_SCK_GPIOx,  SPI2_SCK_GPIO_Pin};

#ifdef SPI2_RX_DMA_Instance
static SPI_DMA SPI2_DMA_Rx = {
  SPI2_RX_DMA_Instance,
  SPI2_RX_DMA_Channel,
  SPI2_RX_DMA_Priority,
  SPI2_RX_DMA_IRQn
};
#endif

#ifdef SPI2_TX_DMA_Instance
static SPI_DMA SPI2_DMA_Tx = {
  SPI2_TX_DMA_Instance,
  SPI2_TX_DMA_Channel,
  SPI2_TX_DMA_Priority,
  SPI2_TX_DMA_IRQn
};
#endif

/* SPI2 Resources */
static const SPI_RESOURCES SPI2_Resources = {
  SPI2,
  RCC_PERIPH_SPI2,
  // PINS
  {
#ifdef USE_SPI2_MOSI_Pin
    &SPI2_mosi,
#else
    NULL,
#endif
#ifdef USE_SPI2_MISO_Pin
    &SPI2_miso,
#else
    NULL,
#endif
#ifdef USE_SPI2_NSS_Pin
    &SPI2_nss,
#else
    NULL,
#endif
    &SPI2_sck,
    SPI2_REMAP_DEF,
    SPI2_REMAP
  },
  SPI2_IRQn,
#ifdef SPI2_RX_DMA_Instance
  &SPI2_DMA_Rx,
#else
  NULL,
#endif
#ifdef SPI2_TX_DMA_Instance
  &SPI2_DMA_Tx,
#else
  NULL,
#endif
  &SPI2_Info,
  &SPI2_TransferInfo
};
#endif /* USE_SPI2 */

#if defined(USE_SPI3)

/* SPI3 Run-Time Information */
static SPI_INFO          SPI3_Info         = { 0U };
static SPI_TRANSFER_INFO SPI3_TransferInfo = { 0U };


#ifdef USE_SPI3_MOSI_Pin
  static SPI_PIN SPI3_mosi = {SPI3_MOSI_GPIOx, SPI3_MOSI_GPIO_Pin};
#endif
#ifdef USE_SPI3_MISO_Pin
  static SPI_PIN SPI3_miso = {SPI3_MISO_GPIOx, SPI3_MISO_GPIO_Pin};
#endif
#ifdef USE_SPI3_NSS_Pin
  static SPI_PIN SPI3_nss  = {SPI3_NSS_GPIOx,  SPI3_NSS_GPIO_Pin};
#endif
  static SPI_PIN SPI3_sck  = {SPI3_SCK_GPIOx,  SPI3_SCK_GPIO_Pin};

#ifdef SPI3_RX_DMA_Instance
static SPI_DMA SPI3_DMA_Rx = {
  SPI3_RX_DMA_Instance,
  SPI3_RX_DMA_Channel,
  SPI3_RX_DMA_Priority,
  SPI3_RX_DMA_IRQn
};
#endif
#ifdef SPI3_TX_DMA_Instance
static SPI_DMA SPI3_DMA_Tx = {
  SPI3_TX_DMA_Instance,
  SPI3_TX_DMA_Channel,
  SPI3_TX_DMA_Priority,
  SPI3_TX_DMA_IRQn
  };
#endif

/* SPI3 Resources */
static const SPI_RESOURCES SPI3_Resources = {
  SPI3,
  RCC_PERIPH_SPI3,
  // PINS
  {
#ifdef USE_SPI3_MOSI_Pin
    &SPI3_mosi,
#else
    NULL,
#endif
#ifdef USE_SPI3_MISO_Pin
    &SPI3_miso,
#else
    NULL,
#endif
#ifdef USE_SPI3_NSS_Pin
    &SPI3_nss,
#else
    NULL,
#endif
    &SPI3_sck,
    SPI3_REMAP_DEF,
    SPI3_REMAP
  },
  SPI3_IRQn,
#ifdef SPI3_RX_DMA_Instance
  &SPI3_DMA_Rx,
#else
  NULL,
#endif
#ifdef SPI3_TX_DMA_Instance
  &SPI3_DMA_Tx,
#else
  NULL,
#endif
  &SPI3_Info,
  &SPI3_TransferInfo
};
#endif /* USE_SPI3 */

