koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/SPI_STM32F1xx.c
/*******************************************************************************
 *  function implementations (scope: module-local)
 ******************************************************************************/

/**
 * @fn          void PinConfig(const SPI_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
 * @brief       Configure Pin
 * @param[in]   io       Pointer to SPI_PIN
 * @param[in]   pin_cfg  Pointer to GPIO_PIN_CFG_t
 */
static
void PinConfig(const SPI_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
{
  if ((io == NULL) || (pin_cfg == NULL))
    return;

  if (GPIO_GetPortClockState(io->port) == GPIO_PORT_CLK_DISABLE)
    GPIO_PortClock(io->port, GPIO_PORT_CLK_ENABLE);

  GPIO_PinConfig(io->port, io->pin, pin_cfg);
}

/**
 *
 * @return
 */
int32_t CalcPrescalerValue(const SPI_RESOURCES *spi, uint32_t freq)
{
  int32_t val;

  uint32_t pclk = RCC_GetPeriphFreq(spi->periph);
  for (val = 0; val < 8; val++) {
    if (freq >= (pclk >> (val + 1)))
      break;
  }

  if ((val == 8) || (freq < (pclk >> (val + 1)))) {
    // Requested Bus Speed can not be configured
    val = -1;
  }

  return (val);
}

/**
 * @fn          DRIVER_VERSION SPIx_GetVersion(void)
 * @brief       Get SPI driver version.
 * @return      \ref DRV_VERSION
 */
static
DRIVER_VERSION SPIx_GetVersion(void)
{
  return DriverVersion;
}

/**
 * @fn          SPI_CAPABILITIES SPIx_GetCapabilities(void)
 * @brief       Get driver capabilities.
 * @return      \ref SPI_CAPABILITIES
 */
static
SPI_CAPABILITIES SPIx_GetCapabilities(void)
{
  return DriverCapabilities;
}

/**
 * @fn          int32_t SPI_Initialize(SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi)
 * @brief       Initialize SPI Interface.
 * @param[in]   cb_event  Pointer to \ref SPI_SignalEvent
 * @param[in]   spi       Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Initialize(SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;

  if (info->state & SPI_INITIALIZED)
    return DRIVER_OK;

  /* Initialize SPI Run-Time Resources */
  info->cb_event          = cb_event;
  info->status.busy       = 0U;
  info->status.data_lost  = 0U;
  info->status.mode_fault = 0U;

  /* Clear transfer information */
  memset(spi->xfer, 0, sizeof(SPI_TRANSFER_INFO));

  /* Setup pin remap */
  GPIO_AFConfig(spi->io.afio);

  SPI_IO *io = &spi->io;
  const GPIO_PIN_CFG_t *pin_cfg = &SPI_pin_cfg_af;

  /* Configure MISO Pin */
  PinConfig(io->miso, pin_cfg);
  /* Configure MOSI Pin */
  PinConfig(io->mosi, pin_cfg);
  /* Configure SCK Pin */
  PinConfig(io->sck, pin_cfg);

#ifdef __SPI_DMA
  DMA_ChannelInitialize((DMA_INFO *)spi->rx_dma);
  DMA_ChannelInitialize((DMA_INFO *)spi->tx_dma);
#endif

  info->state = SPI_INITIALIZED;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t SPI_Uninitialize(const SPI_RESOURCES *spi)
 * @brief       De-initialize SPI Interface.
 * @param[in]   spi  Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Uninitialize(const SPI_RESOURCES *spi)
{
  SPI_IO *io = &spi->io;
  const GPIO_PIN_CFG_t *pin_cfg = &SPI_pin_cfg_analog;

  /* Unconfigure MISO Pin */
  PinConfig(io->miso, pin_cfg);
  /* Unconfigure MOSI Pin */
  PinConfig(io->mosi, pin_cfg);
  /* Unconfigure SCK Pin */
  PinConfig(io->sck, pin_cfg);
  /* Unconfigure NSS Pin */
  PinConfig(io->nss, pin_cfg);

  /* Uncofigure pin remapping */
  GPIO_AFConfig(spi->io.afio_def);

#ifdef __SPI_DMA
  DMA_ChannelUninitialize((DMA_INFO *)spi->rx_dma);
  DMA_ChannelUninitialize((DMA_INFO *)spi->tx_dma);
#endif

  /* Clear SPI state */
  spi->info->state = 0U;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t SPI_PowerControl(POWER_STATE state, const SPI_RESOURCES *spi)
 * @brief       Control SPI Interface Power.
 * @param[in]   state  Power state
 * @param[in]   spi    Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_PowerControl(POWER_STATE state, const SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;

  switch (state) {
    case POWER_OFF:
      /* SPI peripheral reset */
      RCC_ResetPeriph(spi->periph);
      /* Disable SPI IRQ */
      NVIC_DisableIRQ(spi->irq_num);

      /* Disable SPI clock */
      RCC_DisablePeriph(spi->periph);

      /* Clear status flags */
      info->status.busy       = 0U;
      info->status.data_lost  = 0U;
      info->status.mode_fault = 0U;

      /* Clear powered flag */
      info->state &= ~SPI_POWERED;
      break;

    case POWER_FULL:
      if ((info->state & SPI_INITIALIZED) == 0U)
        return (DRIVER_ERROR);

      if ((info->state & SPI_POWERED) != 0U)
        return (DRIVER_OK);

      /* Clear status flags */
      info->status.busy       = 0U;
      info->status.data_lost  = 0U;
      info->status.mode_fault = 0U;

      spi->xfer->def_val      = 0U;

      /* Ready for operation - set powered flag */
      info->state |= SPI_POWERED;

      /* Enable SPI clock */
      RCC_EnablePeriph(spi->periph);

      /* SPI peripheral reset */
      RCC_ResetPeriph(spi->periph);

      /* Clear and Enable SPI IRQ */
      NVIC_ClearPendingIRQ(spi->irq_num);
      NVIC_SetPriority(spi->irq_num, DEV_SPI_INT_PRIORITY);
      NVIC_EnableIRQ(spi->irq_num);
      break;

    default:
      return (DRIVER_ERROR_UNSUPPORTED);
  }

  return (DRIVER_OK);
}

/**
 * @fn          int32_t SPI_Send(const void *data, uint32_t num, const SPI_RESOURCES *spi)
 * @brief       Start sending data to SPI transmitter.
 * @param[in]   data  Pointer to buffer with data to send to SPI transmitter
 * @param[in]   num   Number of data items to send
 * @param[in]   spi   Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Send(const void *data, uint32_t num, const SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;
  SPI_TRANSFER_INFO *xfer = spi->xfer;
  SPI_TypeDef *reg = spi->reg;
  uint32_t cr1, cr2;
  uint32_t value;
#ifdef __SPI_DMA
  uint32_t cfg;
#endif

  if ((data == NULL) || (num == 0U))
    return (DRIVER_ERROR_PARAMETER);

  if ((info->state & SPI_CONFIGURED) == 0U)
    return (DRIVER_ERROR);

  if (info->status.busy)
    return (DRIVER_ERROR_BUSY);

  cr1 = reg->CR1;
  cr2 = reg->CR2;

