koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/SPI_STM32F1xx.c
  /* Update SPI statuses */
  info->status.busy       = 1U;
  info->status.data_lost  = 0U;
  info->status.mode_fault = 0U;

  /* Save transfer info */
  xfer->rx_buf = NULL;
  xfer->tx_buf = (uint8_t *)data;
  xfer->num    = num;
  xfer->rx_cnt = 0U;
  xfer->tx_cnt = 0U;

  value = (uint32_t)(*xfer->tx_buf++);

  if (cr1 & SPI_CR1_DFF) {
    value |= (uint32_t)(*xfer->tx_buf++ << 8U);
  }

  /* Write data to data register */
  reg->DR = value;
  ++xfer->tx_cnt;

#ifdef __SPI_DMA_RX
  if (spi->rx_dma != NULL) {
    /* Configure and enable rx DMA channel */
    cfg = DMA_PRIORITY(spi->rx_dma->priority) | DMA_PERIPHERAL_TO_MEMORY | DMA_TRANSFER_COMPLETE_INTERRUPT;

    if (cr1 & SPI_CR1_DFF) {
      /* 16 - bit data frame */
      cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
    }

    DMA_ChannelConfigure(spi->rx_dma->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)(&xfer->dump_val), num);
    DMA_ChannelEnable(spi->rx_dma->instance);

    /* RX Buffer DMA enable */
    cr2 |= SPI_CR2_RXDMAEN;
  }
  else
#endif
  {
    /* Interrupt mode */
    /* RX Buffer not empty interrupt enable */
    cr2 |= SPI_CR2_RXNEIE;
  }

  if (num > 1U) {
#ifdef __SPI_DMA_TX
    if (spi->tx_dma != NULL) {
      cfg = DMA_PRIORITY(spi->tx_dma->priority) | DMA_MEMORY_TO_PERIPHERAL | DMA_MEMORY_INCREMENT | DMA_TRANSFER_COMPLETE_INTERRUPT;

      if (cr1 & SPI_CR1_DFF) {
        /* 16 - bit data frame */
        cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
      }

      DMA_ChannelConfigure(spi->tx_dma->instance, cfg, (uint32_t)&reg->DR, (uint32_t)xfer->tx_buf, num-1);
      DMA_ChannelEnable(spi->tx_dma->instance);

      /* TX Buffer DMA enable */
      cr2 |= SPI_CR2_TXDMAEN;
    }
    else
#endif
    {
      /* Interrupt mode */
      /* TX Buffer empty interrupt enable */
      cr2 |= SPI_CR2_TXEIE;
    }
  }

  reg->CR2 = cr2;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t SPI_Receive(void *data, uint32_t num, const SPI_RESOURCES *spi)
 * @brief       Start receiving data from SPI receiver.
 * @param[out]  data  Pointer to buffer for data to receive from SPI receiver
 * @param[in]   num   Number of data items to receive
 * @param[in]   spi   Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Receive(void *data, uint32_t num, const SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;
  SPI_TRANSFER_INFO *xfer = spi->xfer;
  SPI_TypeDef *reg = spi->reg;
  uint32_t cr2;
#ifdef __SPI_DMA
  uint32_t cr1;
  uint32_t cfg;
#endif

  if ((data == NULL) || (num == 0U))
    return (DRIVER_ERROR_PARAMETER);

  if ((info->state & SPI_CONFIGURED) == 0U)
    return (DRIVER_ERROR);

  if (info->status.busy)
    return (DRIVER_ERROR_BUSY);

#ifdef __SPI_DMA
  cr1 = reg->CR1;
#endif
  cr2 = reg->CR2;

  /* Update SPI statuses */
  info->status.busy       = 1U;
  info->status.data_lost  = 0U;
  info->status.mode_fault = 0U;

  /* Save transfer info */
  xfer->rx_buf = (uint8_t *)data;
  xfer->tx_buf = NULL;
  xfer->num    = num;
  xfer->rx_cnt = 0U;
  xfer->tx_cnt = 0U;

  /* Write data to data register */
  reg->DR = (uint32_t)xfer->def_val;
  ++xfer->tx_cnt;

#ifdef __SPI_DMA_RX
  /* DMA mode */
  if (spi->rx_dma != NULL) {
    cfg = DMA_PRIORITY(spi->rx_dma->priority) | DMA_PERIPHERAL_TO_MEMORY | DMA_MEMORY_INCREMENT | DMA_TRANSFER_COMPLETE_INTERRUPT;

    if (cr1 & SPI_CR1_DFF) {
      /* 16 - bit data frame */
      cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
    }

    DMA_ChannelConfigure(spi->rx_dma->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)xfer->rx_buf, num);
    DMA_ChannelEnable(spi->rx_dma->instance);

    /* RX Buffer DMA enable */
    cr2 |= SPI_CR2_RXDMAEN;
  }
  else
#endif
  {
    /* Interrupt mode */
    /* RX Buffer not empty interrupt enable */
    cr2 |= SPI_CR2_RXNEIE;
  }

  if (num > 1U) {
#ifdef __SPI_DMA_TX
    /* DMA mode */
    if (spi->tx_dma != NULL) {
      cfg = DMA_PRIORITY(spi->tx_dma->priority) | DMA_MEMORY_TO_PERIPHERAL | DMA_TRANSFER_COMPLETE_INTERRUPT;

      if (cr1 & SPI_CR1_DFF) {
        /* 16 - bit data frame */
        cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
      }

      DMA_ChannelConfigure(spi->tx_dma->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)(&xfer->def_val), num-1);
      DMA_ChannelEnable(spi->tx_dma->instance);

      /* TX Buffer DMA enable */
      cr2 |= SPI_CR2_TXDMAEN;
    }
    else
#endif
    {
      /* Interrupt mode */
      /* TX Buffer empty interrupt enable */
      cr2 |= SPI_CR2_TXEIE;
    }
  }

  reg->CR2 = cr2;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t SPI_Transfer(const void *data_out, void *data_in, uint32_t num, const SPI_RESOURCES *spi)
 * @brief       Start sending/receiving data to/from SPI transmitter/receiver.
 * @param[in]   data_out  Pointer to buffer with data to send to SPI transmitter
 * @param[out]  data_in   Pointer to buffer for data to receive from SPI receiver
 * @param[in]   num       Number of data items to transfer
 * @param[in]   spi       Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Transfer(const void *data_out, void *data_in, uint32_t num, const SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;
  SPI_TRANSFER_INFO *xfer = spi->xfer;
  SPI_TypeDef *reg = spi->reg;
  uint32_t cr1, cr2;
  uint32_t value;
#ifdef __SPI_DMA
  uint32_t cfg;
#endif

  if ((data_out == NULL) || (data_in == NULL) || (num == 0U))
    return (DRIVER_ERROR_PARAMETER);

  if ((info->state & SPI_CONFIGURED) == 0U)
    return (DRIVER_ERROR);

  if (info->status.busy)
    return (DRIVER_ERROR_BUSY);

  cr1 = reg->CR1;
  cr2 = reg->CR2;

  /* Update SPI statuses */
  info->status.busy       = 1U;
  info->status.data_lost  = 0U;
  info->status.mode_fault = 0U;

  /* Save transfer info */
  xfer->rx_buf = (uint8_t *)data_in;
  xfer->tx_buf = (uint8_t *)data_out;
  xfer->num    = num;
  xfer->rx_cnt = 0U;
  xfer->tx_cnt = 0U;

  value = (uint32_t)(*xfer->tx_buf++);

  if (cr1 & SPI_CR1_DFF) {
    value |= (uint32_t)(*xfer->tx_buf++ << 8U);
  }

  /* Write data to data register */
  reg->DR = value;
  ++xfer->tx_cnt;

