koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/SPI_STM32F1xx.c
#ifdef __SPI_DMA
  if ((spi->rx_dma != NULL) || (spi->tx_dma != NULL)) {
    /* DMA mode */

    if (spi->rx_dma != NULL) {
      cfg = DMA_PRIORITY(spi->rx_dma->priority) | DMA_PERIPHERAL_TO_MEMORY | DMA_MEMORY_INCREMENT | DMA_TRANSFER_COMPLETE_INTERRUPT;

      if (cr1 & SPI_CR1_DFF) {
        /* 16 - bit data frame */
        cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
      }

      DMA_ChannelConfigure(spi->rx_dma->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)xfer->rx_buf, num);
      DMA_ChannelEnable(spi->rx_dma->instance);

      /* RX Buffer DMA enable */
      cr2 |= SPI_CR2_RXDMAEN;
    }

    if ((num > 1U) && (spi->tx_dma != NULL)) {
      cfg = DMA_PRIORITY(spi->tx_dma->priority) | DMA_MEMORY_TO_PERIPHERAL | DMA_MEMORY_INCREMENT | DMA_TRANSFER_COMPLETE_INTERRUPT;

      if (cr1 & SPI_CR1_DFF) {
        /* 16 - bit data frame */
        cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
      }

      DMA_ChannelConfigure(spi->tx_dma->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)xfer->tx_buf, num-1);
      DMA_ChannelEnable(spi->tx_dma->instance);

      /* TX Buffer DMA enable */
      cr2 |= SPI_CR2_TXDMAEN;
    }
  }
  else
#endif
  {
    /* Interrupt mode */
    /* RX Buffer not empty interrupt enable */
    cr2 |= SPI_CR2_RXNEIE;

    if (num > 1U) {
      /* TX Buffer empty interrupt enable */
      cr2 |= SPI_CR2_TXEIE;
    }
  }

  reg->CR2 = cr2;

  return (DRIVER_OK);
}

/**
 * @fn          uint32_t SPI_GetDataCount(const SPI_RESOURCES *spi)
 * @brief       Get transferred data count.
 * @param[in]   spi  Pointer to SPI resources
 * @return      number of data items transferred
 */
static
uint32_t SPI_GetDataCount(const SPI_RESOURCES *spi)
{
  return (spi->xfer->rx_cnt);
}

/**
 * @fn          int32_t SPI_Control(uint32_t control, uint32_t arg, const SPI_RESOURCES *spi)
 * @brief       Control SPI Interface.
 * @param[in]   control  operation
 * @param[in]   arg      argument of operation (optional)
 * @param[in]   spi      Pointer to SPI resources
 * @return      \ref execution_status
 */
static int32_t SPI_Control(uint32_t control, uint32_t arg, const SPI_RESOURCES *spi)
{
  int32_t br;
  uint32_t mode, val;
  uint32_t cr1, cr2;
  SPI_INFO *info = spi->info;
  SPI_TypeDef *reg = spi->reg;

  mode = 0U;
  val = 0U;
  cr1 = 0U;
  cr2 = 0U;

  if ((info->state & SPI_POWERED) == 0U)
    return (DRIVER_ERROR);

  if ((control & SPI_CONTROL_Msk) == SPI_ABORT_TRANSFER) {
    cr2 = reg->CR2;
    /* Send abort */
    if (spi->tx_dma != NULL) {
      /* DMA mode */
      /* TX buffer DMA disable */
      cr2 &= ~SPI_CR2_TXDMAEN;

      /* Disable TX DMA transfer */
      DMA_ChannelDisable(spi->tx_dma->instance);
    }
    else {
      /* Interrupt mode */
      /* Disable TX buffer empty interrupt */
      cr2 &= ~SPI_CR2_TXEIE;
    }

    /* Receive abort */
    if (spi->rx_dma != NULL) {
      /* DMA mode */
      /* RX buffer DMA disable */
      cr2 &= ~SPI_CR2_RXDMAEN;

      /* Disable RX DMA transfer */
      DMA_ChannelDisable(spi->rx_dma->instance);
    }
    else {
      /* Interrupt mode */
      /* Disable RX buffer not empty interrupt */
      cr2 &= ~SPI_CR2_RXNEIE;
    }

    reg->CR2 = cr2;

    memset(spi->xfer, 0, sizeof(SPI_TRANSFER_INFO));
    info->status.busy = 0U;

    return (DRIVER_OK);
  }

  /* Check for busy flag */
  if (info->status.busy)
    return (DRIVER_ERROR_BUSY);

  switch (control & SPI_CONTROL_Msk) {
    case SPI_MODE_INACTIVE:
      mode |= SPI_MODE_INACTIVE;
      break;

    case SPI_MODE_MASTER:
      mode |= SPI_MODE_MASTER;
      /* Master enabled */
      cr1 |= SPI_CR1_MSTR;
      break;

    case SPI_MODE_SLAVE:
      mode |= SPI_MODE_SLAVE;
      break;

    case SPI_MODE_MASTER_SIMPLEX:
    case SPI_MODE_SLAVE_SIMPLEX:
      return (SPI_ERROR_MODE);

    case SPI_SET_BUS_SPEED:
      /* Set SPI Bus Speed */
      br = CalcPrescalerValue(spi, arg);
      if (br < 0)
        return (DRIVER_ERROR);

      /* Disable SPI, update prescaler and enable SPI */
      reg->CR1 &= ~SPI_CR1_SPE;
      reg->CR1 = (reg->CR1 & ~SPI_CR1_BR_Msk) | (br << SPI_CR1_BR_Pos);
      reg->CR1 |= SPI_CR1_SPE;
      return (DRIVER_OK);

    case SPI_GET_BUS_SPEED:
      /* Return current bus speed */
      return (int32_t)(RCC_GetPeriphFreq(spi->periph) >> (((reg->CR1 & SPI_CR1_BR_Msk) >> SPI_CR1_BR_Pos) + 1U));

    case SPI_SET_DEFAULT_TX_VALUE:
      spi->xfer->def_val = (uint16_t)(arg & 0xFFFFU);
      return (DRIVER_OK);

    case SPI_CONTROL_SS:
      val = (info->mode & SPI_CONTROL_Msk);
      /* Master modes */
      if (val == SPI_MODE_MASTER) {
        val = info->mode & SPI_SS_MASTER_MODE_Msk;
        /* Check if NSS pin is available and
           software slave select master is selected */
        if ((spi->io.nss != NULL) && (val == SPI_SS_MASTER_SW)) {
          SPI_PIN *io = spi->io.nss;
          /* Set/Clear NSS pin */
          if (arg == SPI_SS_INACTIVE)
            GPIO_PinWrite(io->port, io->pin, GPIO_PIN_OUT_HIGH);
          else
            GPIO_PinWrite(io->port, io->pin, GPIO_PIN_OUT_LOW);
        }
        else {
          return (DRIVER_ERROR);
        }

        return (DRIVER_OK);
      }
      /* Slave modes */
      else if (val == SPI_MODE_SLAVE) {
        val = info->mode & SPI_SS_SLAVE_MODE_Msk;
        /* Check if slave select slave mode is selected */
        if (val == SPI_SS_SLAVE_SW) {
          if (arg == SPI_SS_ACTIVE) {
            reg->CR1 |= SPI_CR1_SSI;
          }
          else {
            reg->CR1 &= ~SPI_CR1_SSI;
          }
          return (DRIVER_OK);
        }
        else {
          return (DRIVER_ERROR);
        }
      }
      else {
        return (DRIVER_ERROR);
      }

    default:
      return (DRIVER_ERROR_UNSUPPORTED);
  }

  /* Frame format: */
  switch (control & SPI_FRAME_FORMAT_Msk) {
    case SPI_CPOL0_CPHA0:
      break;
    case SPI_CPOL0_CPHA1:
      cr1 |= SPI_CR1_CPHA;
      break;
    case SPI_CPOL1_CPHA0:
      cr1 |= SPI_CR1_CPOL;
      break;
    case SPI_CPOL1_CPHA1:
      cr1 |= SPI_CR1_CPHA | SPI_CR1_CPOL;
      break;
    case SPI_TI_SSI:
    case SPI_MICROWIRE:
    default:
      return (SPI_ERROR_FRAME_FORMAT);
  }

